app/views/meetings/_form.html.erb

  <div>
    <%= f.collection_select :category_id, Category.all, :id, :name, {:include_blank => "None"} %>
---
SELECT "categories".* FROM "categories" ORDER BY name ASC

    <% for contact in @user.contacts do %>
      <br /><%= check_box_tag 'meeting[contact_ids][]', contact.id,
              @meeting.contacts.include?(contact) %>
---
SELECT 1 FROM "contacts" INNER JOIN "contacts_meetings" ON "contacts"."id" = "contacts_meetings"."contact_id" WHERE "contacts_meetings"."meeting_id" IS NULL AND "contacts"."id" = 3 LIMIT 1