app/views/meetings/show.html.erb

  <ul>
    <% @meeting.contacts.each do |contact| %>
---
SELECT "contacts".* FROM "contacts" INNER JOIN "contacts_meetings" ON "contacts"."id" = "contacts_meetings"."contact_id" WHERE "contacts_meetings"."meeting_id" = 15