app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" ORDER BY name ASC
---
  def index
    @categories = Category.all

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? ORDER BY name ASC LIMIT 1  [["id", "1"]]
---
  def show
    @category = Category.find(params[:id])

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 17 Feb 2012 23:39:19 UTC +00:00], ["name", ":)"], ["updated_at", Fri, 17 Feb 2012 23:39:19 UTC +00:00]]
---
  def create
    @category = Category.new(params[:category])

    if @category.save