app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = 1 AND "contacts"."id" = ? LIMIT 1  [["id", "3"]]
---
  def show
    @contact = @user.contacts.find(params[:id])

SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = 1 AND "contacts"."id" = ? LIMIT 1  [["id", "9"]]
---
  def edit
    @contact = @user.contacts.find(params[:id])

INSERT INTO "contacts" ("address", "birthday", "created_at", "email", "first_name", "last_name", "notes", "phone_number", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @contact = @user.contacts.build(params[:contact])

    if @contact.save

SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = 1 AND "contacts"."id" = ? LIMIT 1  [["id", "9"]]
UPDATE "contacts" SET "notes" = 'To greet Please', "updated_at" = '2012-02-18 21:31:03.369424' WHERE "contacts"."id" = 9
---
  def update
    @contact = @user.contacts.find(params[:id])

    if @contact.update_attributes(params[:contact])

SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = 1 AND "contacts"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 1]]
---
  def destroy
    @contact = @user.contacts.find(params[:id])
    @contact.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
  def load_correct_user
    @user = User.find(params[:user_id]) if User.exists?(params[:user_id])