app/controllers/meetings_controller.rb

  def search
    if params[:contact_name] && params[:contact_name] != ""
      @meetings = @user.search_meetings(params[:contact_name])
    else
      @meetings = @user.meetings.all
---
SELECT "meetings".* FROM "meetings" INNER JOIN "contacts_meetings" ON "contacts_meetings"."meeting_id" = "meetings"."id" INNER JOIN "contacts" ON "contacts"."id" = "contacts_meetings"."contact_id" WHERE ((contacts.first_name LIKE '%.*pa.*%' or contacts.last_name LIKE '%.*pa.*%') and meetings.user_id = 1) ORDER BY date_time ASC

  def index
    @meetings = @user.meetings.all
---
SELECT "meetings".* FROM "meetings" WHERE "meetings"."user_id" = 1 ORDER BY date_time ASC

  def show
    @meeting = @user.meetings.find(params[:id])
---
SELECT "meetings".* FROM "meetings" WHERE "meetings"."user_id" = 1 AND "meetings"."id" = ? ORDER BY date_time ASC LIMIT 1  [["id", "preview"]]

  def edit
    @meeting = @user.meetings.find(params[:id])
---
SELECT "meetings".* FROM "meetings" WHERE "meetings"."user_id" = 1 AND "meetings"."id" = ? ORDER BY date_time ASC LIMIT 1  [["id", "19"]]

  def create
    @meeting = @user.meetings.build(params[:meeting])
    if @meeting.save
---
INSERT INTO "meetings" ("category_id", "created_at", "date_time", "notes", "place", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @meeting = @user.meetings.find(params[:id])
    if @meeting.update_attributes(params[:meeting])
---
SELECT "meetings".* FROM "meetings" WHERE "meetings"."user_id" = 1 AND "meetings"."id" = ? ORDER BY date_time ASC LIMIT 1  [["id", "19"]]
UPDATE "meetings" SET "place" = '', "notes" = 'Hi, sweety', "date_time" = '2014-02-18 01:11:00.000000', "updated_at" = '2012-02-18 21:32:02.802824' WHERE "meetings"."id" = 19

  def destroy
    @meeting = @user.meetings.find(params[:id])
    @meeting.destroy
---
SELECT "meetings".* FROM "meetings" WHERE "meetings"."user_id" = 1 AND "meetings"."id" = ? ORDER BY date_time ASC LIMIT 1  [["id", "2"]]
DELETE FROM "meetings" WHERE "meetings"."id" = ?  [["id", 5]]

  def load_correct_user
    @user = User.find(params[:user_id]) if User.exists?(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]