app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."user_name" = 'slavena' LIMIT 1
---
  def create
  	user = User.find_by_user_name(params[:session][:user_name])